spec/vcr_cassettes/marketplace/refunds/pg_refund/invalid_trans_id.yml

---
http_interactions:
- request:
    method: post
    uri: https://sandboxadmin.citruspay.com/api/v2/txn/refund
    body:
      encoding: UTF-8
      string: '{"merchantTxnId":"RD-0320837687","pgTxnId":"6789994221172191","rrn":"7219386355","authIdCode":"999999","currencyCode":"INR","amount":"12","txnType":"Refund","merchantTxnId":"..."}'
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Host:
      - sandboxadmin.citruspay.com
      Content-Type:
      - application/json
      Signature:
      - '09aaf70d149d936697168f4114bae861ea01ed8a'
      Access-Key:
      - 1DYQI8S5EE5UM97AJYKA
  response:
    status:
      code: 401
      message: Unauthorized
    headers:
      Date:
      - Tue, 08 Aug 2017 05:04:52 GMT
      Server:
      - Apache/2.2.15 (Red Hat)
      Set-Cookie:
      - JSESSIONID=184EC23CF0B8A8A9C43FC825DE2A6B0A.adminnode; Path=/; Secure; HttpOnly
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Allow-Methods:
      - POST, GET, OPTIONS, DELETE, PUT
      Access-Control-Max-Age:
      - '3600'
      Access-Control-Allow-Headers:
      - Authorization,Origin,X-Requested-With,Content-Type,Accept,merchantAccessKey,requestSignature
      Vary:
      - Accept-Encoding
      Connection:
      - close
      Transfer-Encoding:
      - chunked
      Content-Type:
      - application/xml;charset=UTF-8
    body:
      encoding: ASCII-8BIT
      string: <?xml version="1.0" encoding="UTF-8" standalone="yes"?><response><noOfTxnsToDisplay>0</noOfTxnsToDisplay><respCode>401</respCode><respMsg>Bad
        Request:Invalid signature key</respMsg><totalTxnCount>0</totalTxnCount></response>
    http_version: 
  recorded_at: Tue, 08 Aug 2017 05:08:08 GMT
recorded_with: VCR 3.0.3
